{
  "backend/main.mo": "Main Motoko actor for the Flight Log Manager app, defining data types and CRUD operations for flights, aircraft, students, instructors, exercises, and user profiles, with role-based access control via AccessControl and MixinAuthorization mixins.",
  "backend/migration.mo": "Migration module that transforms the old actor state (aircraft stored as a Set of entities) into the new state (aircraft stored as a Map with totalHours and hourLog fields).",
  "feature_evidence.json": "Feature evidence report linking two implemented features—Aircraft Hours tracking on the Manage Aircraft page and combined hours display on the Dashboard—to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of all frontend source files, describing the purpose of each component, page, hook, and utility in the React frontend.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for the light and dark color themes used throughout the app, including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes, handles authentication state via Internet Identity, conditionally shows the login screen or profile setup modal, and wraps authenticated pages in a layout with a footer.",
  "frontend/src/components/AppSidebar.tsx": "Collapsible sidebar navigation component using shadcn Sidebar primitives, rendering links to all main and management pages, displaying the user's profile name, and providing a logout button.",
  "frontend/src/components/EntityManager.tsx": "A reusable CRUD component for managing named entities (e.g. students, aircraft) with add, inline-edit, and delete functionality using React Query mutations.",
  "frontend/src/components/FlightRecordsTable.tsx": "Displays a list of flight records in a responsive table (desktop) with badge components for flight type and landing type.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the app with a collapsible sidebar and a sticky header, rendering child routes via an Outlet.",
  "frontend/src/components/LoginScreen.tsx": "Authentication screen that handles Internet Identity login/logout with loading and error states, plus a feature preview section.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time users to enter their name and email, with validation and a React Query mutation to save the profile.",
  "frontend/src/components/StatCard.tsx": "A simple presentational card component that displays a statistic with a title, value, optional subtitle, and an icon.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to handle login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, dashboard stats, entities (students/instructors/aircraft/exercises), flight logging, filtering, and aircraft management.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines aviation-themed CSS custom properties for light and dark modes using OKLCH color values.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that computes and displays flight statistics (daily/monthly counts, durations) and aircraft utilization by combining flight log data with manual aircraft hour entries.",
  "frontend/src/pages/FlightRecords.tsx": "Flight records page with filterable table by month, student, and aircraft, plus CSV export functionality using React Query for data fetching.",
  "frontend/src/pages/LogFlight.tsx": "Form page for logging a new flight entry with fields for date, student, instructor, aircraft, exercise, flight type, times, and landing details, including client-side validation and duration calculation.",
  "frontend/src/pages/ManageAircraft.tsx": "Page for managing aircraft, including adding new aircraft, editing/deleting existing ones, and recording daily flight hours with a collapsible history view.",
  "frontend/src/pages/ManageExercises.tsx": "Page that displays and manages training exercises using the generic EntityManager component.",
  "frontend/src/pages/ManageInstructors.tsx": "Page that displays and manages the instructor roster using the generic EntityManager component.",
  "frontend/src/pages/ManageStudents.tsx": "Page that displays and manages the student roster using the generic EntityManager component.",
  "frontend/src/pages/NotFound.tsx": "Simple 404 not-found page with a link back to the dashboard.",
  "frontend/src/utils/csvExport.ts": "Utility that converts an array of FlightEntry records to a CSV file and triggers a browser download, with proper escaping and a UTF-8 BOM for Excel compatibility.",
  "frontend/src/utils/timeUtils.ts": "Collection of utility functions for parsing, formatting, and converting time values including HH:MM strings, nanosecond bigint timestamps, and duration formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and removing sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and keyframe animations for the application's design system.",
  "project_state.json": "Tracks the state and version of the Flight Log Manager web application project, including feature list, architectural notes, and known issues. Describes a browser-based aviation school app with authentication, flight logging, CRUD management, and CSV/Excel export."
}