{
  "backend/main.mo": "Main Motoko actor for the Flight Log Manager backend, defining data types (FlightEntry, Aircraft, Entity) and CRUD operations for flights, aircraft, entities, and user profiles with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence features related to fixing the LogFlight page, ManageAircraft page actions, and useQueries.ts mutation hooks, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering styles, utilities, hooks, components, and pages for the Flight Log Manager React app.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "Minimal HTML entry point for the Flight Log Manager Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with authentication guards, profile setup modal, all page routes, a footer, and the Toaster notification provider.",
  "frontend/src/components/AppSidebar.tsx": "Collapsible sidebar navigation component with links to all app sections, active-state highlighting, user profile display, and logout functionality using the shadcn Sidebar primitives.",
  "frontend/src/components/EntityManager.tsx": "A reusable CRUD component for managing named entities (e.g., students, aircraft) with add, inline-edit, and delete functionality using React Query mutations.",
  "frontend/src/components/FlightRecordsTable.tsx": "Displays a list of flight records in a responsive table (desktop) with badge components for flight type and landing type (day/night).",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the app with a collapsible sidebar, sticky header with a sidebar trigger, and a main content area rendered via React Router's Outlet.",
  "frontend/src/components/LoginScreen.tsx": "Authentication screen that handles Internet Identity login/logout with loading and error states, plus a branding/feature preview UI.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time users to enter their name and email, with validation and a React Query mutation to save the profile.",
  "frontend/src/components/StatCard.tsx": "A simple presentational card component that displays a statistic with a title, value, optional subtitle, and an icon with optional accent styling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profiles, dashboard stats, entities (students/aircraft/etc.), and flight entries with CRUD mutations.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind, and defines an aviation-themed dark/light color palette using CSS custom properties with OKLCH values.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that computes and displays flight statistics (daily/monthly counts, aircraft utilization, recent flights) client-side from raw flight data fetched via React Query.",
  "frontend/src/pages/FlightRecords.tsx": "Flight records page with filterable table supporting month, student, and aircraft filters, plus CSV export functionality.",
  "frontend/src/pages/LogFlight.tsx": "Form page for logging a new flight entry with validation for date, student, instructor, aircraft, exercise, flight type, times, and landing details.",
  "frontend/src/pages/ManageAircraft.tsx": "React page for managing aircraft, providing forms to add aircraft, record daily day/night hours, and inline edit/delete existing aircraft entries using React Query mutations.",
  "frontend/src/pages/ManageExercises.tsx": "React page that fetches and displays training exercises using the EntityManager component for CRUD operations.",
  "frontend/src/pages/ManageInstructors.tsx": "React page that fetches and displays the instructor roster using the EntityManager component for CRUD operations.",
  "frontend/src/pages/ManageStudents.tsx": "React page that fetches and displays the student roster using the EntityManager component for CRUD operations.",
  "frontend/src/pages/NotFound.tsx": "Simple 404 page component that displays a not-found message and a link back to the dashboard.",
  "frontend/src/utils/csvExport.ts": "Utility that converts an array of FlightEntry objects into a CSV file and triggers a browser download, with proper UTF-8 BOM and field escaping.",
  "frontend/src/utils/timeUtils.ts": "Collection of utility functions for parsing, formatting, and validating time/date values, including conversions between HH:MM strings, minutes, nanosecond bigint timestamps, and human-readable formats.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens, border radii, box shadows, and keyframe animations for the app's design system.",
  "project_state.json": "Project state metadata tracking existing features, known issues (broken flight log for aircraft), and pending tasks for a flight logging application built on ICP/Motoko."
}