{
  "kind": "build_request",
  "title": "Fix Flight Log and Aircraft functionality",
  "projectName": "Flight Log Manager",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the LogFlight page so that submitting a new flight entry correctly calls the backend mutation, persists the record, and displays a success notification. Ensure all required fields (date, student, instructor, aircraft, exercise, flight type, times, landing details) are properly validated and submitted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Flight log not working Aircraft please solve"
        ]
      },
      "acceptanceCriteria": [
        "User can submit a complete flight entry from the LogFlight page without errors",
        "The flight record appears in the FlightRecords table after submission",
        "A success toast notification is shown on successful log",
        "Validation errors are shown inline for missing or invalid fields"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Diagnose and fix all action buttons (edit, delete, update daily hours) on the ManageAircraft page. Ensure the React Query mutations for adding aircraft, updating aircraft, deleting aircraft, and recording daily hours are correctly wired and the UI reflects changes after each mutation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Flight log not working Aircraft please solve"
        ]
      },
      "acceptanceCriteria": [
        "Add Aircraft form successfully creates a new aircraft and shows it in the list",
        "Inline edit on an aircraft row saves changes and updates the list",
        "Delete button removes the aircraft from the list with confirmation",
        "Record daily hours form updates aircraft hours and reflects the new value",
        "All mutations invalidate the aircraft query cache so the list re-fetches"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit the useQueries.ts hooks for the flight log and aircraft mutations. Ensure that mutation functions correctly call the backend actor methods, that onSuccess handlers invalidate the appropriate query keys, and that error states are handled and surfaced to the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Flight log not working Aircraft please solve"
        ]
      },
      "acceptanceCriteria": [
        "All aircraft-related mutations (add, update, delete, daily hours) call the correct backend actor methods",
        "All flight log mutations (add flight entry) call the correct backend actor method",
        "onSuccess callbacks invalidate relevant query keys (aircraft list, flight records, dashboard stats)",
        "Errors returned from the backend are caught and displayed to the user"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Verify the backend Motoko actor CRUD operations for flight entries and aircraft are correctly implemented and returning expected results. Ensure addFlightEntry, updateAircraft, deleteAircraft, and recordDailyHours functions handle all edge cases (missing records, authorization) without silent failures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Flight log not working Aircraft please solve"
        ]
      },
      "acceptanceCriteria": [
        "addFlightEntry returns an ok result when given valid data",
        "updateAircraft and deleteAircraft return errors with descriptive messages when the aircraft does not exist",
        "recordDailyHours correctly accumulates hours for the target aircraft",
        "Role-based access control does not silently block authorized users from performing mutations"
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui",
    "All backend logic must remain in the single main actor file backend/main.mo"
  ],
  "nonGoals": [
    "Adding new features such as filtering, search, or CSV export changes",
    "Redesigning the visual theme or layout",
    "Adding new pages or navigation items"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}