{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Flight Log and Aircraft functionality",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix LogFlight page to correctly submit flight entries with proper validation, backend mutation calls, success notifications, and error handling",
      "acceptanceCriteria": [
        "User can submit a complete flight entry from the LogFlight page without errors",
        "The flight record appears in the FlightRecords table after submission",
        "A success toast notification is shown on successful log",
        "Validation errors are shown inline for missing or invalid fields"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LogFlight.tsx",
          "operation": "modify",
          "description": "Fix the form submission handler to properly call the addFlightEntry mutation with all required fields (date, student, instructor, aircraft, exercise, flightType, takeoffTime, landingTime, duration, landingType, landingCount). Ensure the mutation's onSuccess callback shows a success toast and resets the form. Add proper error handling to display validation errors inline for missing or invalid fields. Verify that the duration calculation from takeoffTime and landingTime is correct before submission."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useAddFlightEntry mutation hook to correctly call actor.addFlightEntry with all parameters in the correct order matching the backend interface signature. Ensure the onSuccess callback invalidates the query keys ['flights'], ['dashboardStats'], and any entity lists that might be affected. Add proper error catching and ensure errors from the backend are surfaced to the UI via the mutation's error state."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix all action buttons on ManageAircraft page including add, edit, delete, and daily hours recording with proper mutation wiring and cache invalidation",
      "acceptanceCriteria": [
        "Add Aircraft form successfully creates a new aircraft and shows it in the list",
        "Inline edit on an aircraft row saves changes and updates the list",
        "Delete button removes the aircraft from the list with confirmation",
        "Record daily hours form updates aircraft hours and reflects the new value",
        "All mutations invalidate the aircraft query cache so the list re-fetches"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ManageAircraft.tsx",
          "operation": "modify",
          "description": "Fix all mutation handlers for add aircraft, inline edit, delete, and record daily hours. Ensure the add aircraft form calls the mutation with proper AircraftInput shape (name, totalHours). Fix the inline edit handler to call updateAircraft with the correct aircraftId and updated data. Ensure the delete button shows a confirmation dialog before calling deleteAircraft. Fix the record daily hours form to call recordDailyHours with aircraftId, dayHours, and nightHours. Add proper loading states and error feedback for each action. Ensure success toasts are shown after each successful mutation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix all aircraft-related mutation hooks (useAddAircraft, useUpdateAircraft, useDeleteAircraft, useRecordDailyHours) to correctly call the corresponding actor methods with proper parameter types and order. Ensure each mutation's onSuccess callback invalidates the query keys ['entities', 'aircraft'], ['dashboardStats'], and ['flights'] where applicable. Add proper error handling so backend errors are caught and exposed via the mutation error state for UI display."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Audit and fix useQueries.ts hooks for flight log and aircraft mutations to ensure correct actor method calls, query invalidation, and error handling",
      "acceptanceCriteria": [
        "All aircraft-related mutations (add, update, delete, daily hours) call the correct backend actor methods",
        "All flight log mutations (add flight entry) call the correct backend actor method",
        "onSuccess callbacks invalidate relevant query keys (aircraft list, flight records, dashboard stats)",
        "Errors returned from the backend are caught and displayed to the user"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Comprehensively audit all mutation hooks (useAddFlightEntry, useAddAircraft, useUpdateAircraft, useDeleteAircraft, useRecordDailyHours) to verify they match the backend interface signature from backend.d.ts. Fix any parameter type mismatches or incorrect ordering. Ensure all onSuccess handlers invalidate the appropriate query keys: ['flights'] for flight mutations, ['entities', 'aircraft'] for aircraft mutations, ['dashboardStats'] for operations affecting stats. Wrap all actor calls in try-catch blocks and ensure errors are properly propagated to the mutation error state. Add descriptive error messages that can be displayed in the UI."
        }
      ]
    }
  ]
}